---
kind: property
id: P:Autodesk.Revit.DB.Group.IsAttached
source: html/fe1c02cc-e67f-2049-8bef-1df2f26fe37d.htm
---
# Autodesk.Revit.DB.Group.IsAttached Property

Indicates wether or not this group is attached to a parent group.

## Syntax (C#)
```csharp
public bool IsAttached { get; }
```